docs/journal/2019-04-13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="clothoid" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc9c74e2">1. 2019-04-13</a>
<ul>
<li><a href="#org34fab58">1.1. 01:16</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc9c74e2" class="outline-2">
<h2 id="orgc9c74e2"><span class="section-number-2">1.</span> 2019-04-13</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org34fab58" class="outline-3">
<h3 id="org34fab58"><span class="section-number-3">1.1.</span> 01:16</h3>
<div class="outline-text-3" id="text-1-1">
<p>
あれ時刻が入らない。
まあ、いいか。
今日から英語の勉強を再開した。
といっても、色々調べていただけで、実際の英語の勉強はほとんどしていない。
</p>

<p>
I was wondering if I'd left it up there by mistake が早すぎてなかかな言えなかった。
Has anything been handed in という言い方は口から絶対出てこな言い方だなあと思った。
</p>

<p>
left it up の up は VOC の C だという話を相方から貰ってビックリした。
副詞だと思っていたが、そうかもしれない。
そういう感覚がないのが悔しいところ。
</p>

<p>
speech.sh という google translater を使ってつくったものが残っていた。
巷に溢れているのは使いものにならなかった。
google が API を制限したのだろう。
ここでも公開はしないようにしておこう。
</p>

<p>
jsay と合わせて瞬間英作文を自分で作れることが分かった。
</p>

<p>
無音の mp3 を作成するには以下のようにすればいいことが分かった。
</p>

<div class="org-src-container">
<pre class="src src-sh">arecord -d 3 &lt;/dev/zero | lame - -b 32 -h silence.mp3
</pre>
</div>

<p>
上記は 3 秒の無音。
しかし、その無音の 3 秒間で、ファイルが終了したと見なされる場合が多いことも分かった。
なので、mp4 への変換
</p>

<div class="org-src-container">
<pre class="src src-sh">ffmpeg -i output.mp3 -shortest -b 1000k -acodec copy output.mp4
</pre>
</div>

<p>
などとすると、これは前半部分が終った状態で Chrome 再生が止まる場合もあることが分かった。
VLC でも mp3 で再生すると別の曲として始まる。
何か 3 秒間のうまいいいものを作らないとという感じ。
</p>

<p>
こんなことをやってたら昼飯を食べそこなったので、パン屋で久しぶりにソーセージパンを食べた。
</p>

<p>
携帯やイヤホンを見たりした。
骨伝導を試してみたが、いいような悪いような。フィット感がない。
イヤホンは耳の穴が蒸れてしまい、外耳炎が悪化するようで、英語の勉強とのトレードオフになることも分かった。
しかたない。うまくいかないものだ。
</p>

<p>
おいしくて安いコーヒー屋をみつけた。
店員がうるさかった。
</p>

<p>
行ってみたかった中華屋に行った。
ディオニーのワインが飲めるというところで非常によかった。
安かったし。
最初会計間違いだったが。
</p>

<p>
そのまま有名な担々麺の店で辛くなくてシビれるだけを頼んだ。
イマイチだった。
辛い方がいいのかもしれない。
汁なし。
</p>

<p>
相方は辛いのだけで、シビれないように頼んだ。
イマイチだった。
合わせて担々麺なんだって分かった。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
